## Description

The essence of the patch is that the `guid` segment (name@vhost@guid) is added to the resource ID (for `queue` and `exchange`), which is used as a trigger to recreate the `binding` if the value of the `source` or `destination` attributes is not the name, but the resource IDs of the parents.

Applied for the following resources: `queue`, `exchange`, `binding` (as the most used).

## Example

1. Create two groups of related resources [queue <- exchange]  <- [exchange]
```
$ terraform plan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.exchange_test_child.rabbitmq_binding.binding[0] will be created
  + resource "rabbitmq_binding" "binding" {
      + destination      = (known after apply)
      + destination_type = "exchange"
      + id               = (known after apply)
      + properties_key   = (known after apply)
      + routing_key      = "routing_key.3"
      + source           = (known after apply)
      + vhost            = "/"
    }

  # module.exchange_test_child.rabbitmq_binding.binding[1] will be created
  + resource "rabbitmq_binding" "binding" {
      + destination      = (known after apply)
      + destination_type = "exchange"
      + id               = (known after apply)
      + properties_key   = (known after apply)
      + routing_key      = "routing_key.4"
      + source           = (known after apply)
      + vhost            = "/"
    }

  # module.exchange_test_child.rabbitmq_exchange.exchange will be created
  + resource "rabbitmq_exchange" "exchange" {
      + id    = (known after apply)
      + name  = "exchange-test-child"
      + vhost = "/"

      + settings {
          + auto_delete = false
          + durable     = true
          + type        = "topic"
        }
    }

  # module.bus_test_parent.module.rabbitmq_exchange.rabbitmq_binding.binding[0] will be created
  + resource "rabbitmq_binding" "binding" {
      + destination      = "q_test"
      + destination_type = "queue"
      + id               = (known after apply)
      + properties_key   = (known after apply)
      + routing_key      = "routing_key.1"
      + source           = (known after apply)
      + vhost            = "/"
    }

  # module.bus_test_parent.module.rabbitmq_exchange.rabbitmq_binding.binding[1] will be created
  + resource "rabbitmq_binding" "binding" {
      + destination      = "q_test"
      + destination_type = "queue"
      + id               = (known after apply)
      + properties_key   = (known after apply)
      + routing_key      = "routing_key.2"
      + source           = (known after apply)
      + vhost            = "/"
    }

  # module.bus_test_parent.module.rabbitmq_exchange.rabbitmq_exchange.exchange will be created
  + resource "rabbitmq_exchange" "exchange" {
      + id    = (known after apply)
      + name  = "exchange-test-parent"
      + vhost = "/"

      + settings {
          + auto_delete = false
          + durable     = true
          + type        = "topic"
        }
    }

  # module.bus_test_parent.module.rabbitmq_queue["q_test"].rabbitmq_queue.queue will be created
  + resource "rabbitmq_queue" "queue" {
      + id    = (known after apply)
      + name  = "q_test"
      + vhost = "/"

      + settings {
          + arguments_json = jsonencode(
                {
                  + x-queue-type             = "quorum"
                  + x-single-active-consumer = true
                }
            )
          + auto_delete    = false
          + durable        = true
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```

2. Change queue type from `quorum -> classic`

```
$ terraform apply

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.exchange_test_child.rabbitmq_binding.binding[0] has changed
  ~ resource "rabbitmq_binding" "binding" {
      + arguments        = {}
        id               = "%2F/exchange-test-child/exchange-test-parent/exchange/routing_key.3/fb073429-77f9-f4df-642d-5af0dcdc6a1d/f5cecf0d-f10e-33e5-1832-c6b13cda3d67"
        # (6 unchanged attributes hidden)
    }

  # module.exchange_test_child.rabbitmq_binding.binding[1] has changed
  ~ resource "rabbitmq_binding" "binding" {
      + arguments        = {}
        id               = "%2F/exchange-test-child/exchange-test-parent/exchange/routing_key.4/fb073429-77f9-f4df-642d-5af0dcdc6a1d/f5cecf0d-f10e-33e5-1832-c6b13cda3d67"
        # (6 unchanged attributes hidden)
    }

  # module.exchange_test_child.rabbitmq_exchange.exchange has changed
  ~ resource "rabbitmq_exchange" "exchange" {
        id    = "exchange-test-child@/@fb073429-77f9-f4df-642d-5af0dcdc6a1d"
        name  = "exchange-test-child"
        # (1 unchanged attribute hidden)

      ~ settings {
          + arguments   = {}
            # (3 unchanged attributes hidden)
        }
    }

  # module.bus_test_parent.module.rabbitmq_exchange.rabbitmq_binding.binding[0] has changed
  ~ resource "rabbitmq_binding" "binding" {
      + arguments        = {}
        id               = "%2F/exchange-test-parent/q_test/queue/routing_key.1/f5cecf0d-f10e-33e5-1832-c6b13cda3d67/"
        # (6 unchanged attributes hidden)
    }

  # module.bus_test_parent.module.rabbitmq_exchange.rabbitmq_binding.binding[1] has changed
  ~ resource "rabbitmq_binding" "binding" {
      + arguments        = {}
        id               = "%2F/exchange-test-parent/q_test/queue/routing_key.2/f5cecf0d-f10e-33e5-1832-c6b13cda3d67/"
        # (6 unchanged attributes hidden)
    }

  # module.bus_test_parent.module.rabbitmq_exchange.rabbitmq_exchange.exchange has changed
  ~ resource "rabbitmq_exchange" "exchange" {
        id    = "exchange-test-parent@/@f5cecf0d-f10e-33e5-1832-c6b13cda3d67"
        name  = "exchange-test-parent"
        # (1 unchanged attribute hidden)

      ~ settings {
          + arguments   = {}
            # (3 unchanged attributes hidden)
        }
    }

  # module.bus_test_parent.module.rabbitmq_queue["q_test"].rabbitmq_queue.queue has changed
  ~ resource "rabbitmq_queue" "queue" {
        id    = "q_test@/@260ff858-5db2-52c2-8992-1cbf517865bf"
        name  = "q_test"
        # (1 unchanged attribute hidden)

      ~ settings {
          + arguments      = {}
            # (3 unchanged attributes hidden)
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.exchange_test_child.rabbitmq_binding.binding[0] must be replaced
-/+ resource "rabbitmq_binding" "binding" {
      - arguments        = {} -> null
      ~ destination      = "exchange-test-parent" -> "exchange-test-parent@/@f5cecf0d-f10e-33e5-1832-c6b13cda3d67" # forces replacement
      ~ id               = "%2F/exchange-test-child/exchange-test-parent/exchange/routing_key.3/fb073429-77f9-f4df-642d-5af0dcdc6a1d/f5cecf0d-f10e-33e5-1832-c6b13cda3d67" -> (known after apply)
      ~ properties_key   = "routing_key.3" -> (known after apply)
      ~ source           = "exchange-test-child" -> "exchange-test-child@/@fb073429-77f9-f4df-642d-5af0dcdc6a1d" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.exchange_test_child.rabbitmq_binding.binding[1] must be replaced
-/+ resource "rabbitmq_binding" "binding" {
      - arguments        = {} -> null
      ~ destination      = "exchange-test-parent" -> "exchange-test-parent@/@f5cecf0d-f10e-33e5-1832-c6b13cda3d67" # forces replacement
      ~ id               = "%2F/exchange-test-child/exchange-test-parent/exchange/routing_key.4/fb073429-77f9-f4df-642d-5af0dcdc6a1d/f5cecf0d-f10e-33e5-1832-c6b13cda3d67" -> (known after apply)
      ~ properties_key   = "routing_key.4" -> (known after apply)
      ~ source           = "exchange-test-child" -> "exchange-test-child@/@fb073429-77f9-f4df-642d-5af0dcdc6a1d" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.bus_test_parent.module.rabbitmq_exchange.rabbitmq_binding.binding[0] must be replaced
-/+ resource "rabbitmq_binding" "binding" {
      - arguments        = {} -> null
      ~ id               = "%2F/exchange-test-parent/q_test/queue/routing_key.1/f5cecf0d-f10e-33e5-1832-c6b13cda3d67/" -> (known after apply)
      ~ properties_key   = "routing_key.1" -> (known after apply)
      ~ source           = "exchange-test-parent" -> "exchange-test-parent@/@f5cecf0d-f10e-33e5-1832-c6b13cda3d67" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.bus_test_parent.module.rabbitmq_exchange.rabbitmq_binding.binding[1] must be replaced
-/+ resource "rabbitmq_binding" "binding" {
      - arguments        = {} -> null
      ~ id               = "%2F/exchange-test-parent/q_test/queue/routing_key.2/f5cecf0d-f10e-33e5-1832-c6b13cda3d67/" -> (known after apply)
      ~ properties_key   = "routing_key.2" -> (known after apply)
      ~ source           = "exchange-test-parent" -> "exchange-test-parent@/@f5cecf0d-f10e-33e5-1832-c6b13cda3d67" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.bus_test_parent.module.rabbitmq_queue["q_test"].rabbitmq_queue.queue must be replaced
-/+ resource "rabbitmq_queue" "queue" {
      ~ id    = "q_test@/@260ff858-5db2-52c2-8992-1cbf517865bf" -> (known after apply)
        name  = "q_test"
        # (1 unchanged attribute hidden)

      ~ settings {
          - arguments      = {} -> null
          ~ arguments_json = jsonencode(
              ~ {
                  ~ x-queue-type             = "quorum" -> "classic"
                  - x-single-active-consumer = true -> null
                } # forces replacement
            )
            # (2 unchanged attributes hidden)
        }
    }

Plan: 5 to add, 0 to change, 5 to destroy.
```